testCases/T3A/EARSMTrans/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    libs ("libsampling.so");
    writeControl    writeTime;

    surfaceFormat   raw;
    fields          (wallShearStress);

    interpolationScheme cell;

    surfaces
    (
        wall
        {
            type            patch;
            patches         ("lowerWall");
            interpolate     false;
        }
    );
}

// ************************************************************************* //
